{
"About": {
  "Name": "Shukra Jaliya Nankabirwa",
  "Currently": "Computer Science Student",
  "Headshot": "portraite.png",
  "Thumbnail": "logo.webp",
  "AboutText": "Hi, I am Shukra Jaliya. I am a passionate computer science student with a keen interest in software development and programming. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of computer science, with a particular focus on C++ programming.<br><br>I enjoy tackling challenging programming projects and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>Beyond the classroom, I actively engage in extracurricular activities related to computer science, including hackathons, coding competitions, and open-source contributions. I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies."
},

"Contact": {
  "EMail": "nankabirwas@spu.edu",
  "Phone": "444-44-4444",
  "Portfolio": "https://github.com/ShukraJaliya/github.io",
  "LinkedIn": "https://www.linkedin.com/in/shukra-nankabirwa/",
  "GitHub": "https://www.github.com"
},
"Experience": {
  "ExperienceText": "I am a 3rd year STEM student majoring in Computer Science and Honors Liberal Arts, with a minor in Data Analytics. My goal is to pursue a career in software development and cybersecurity. I am driven by a deep passion for continuous learning and I am eager to gain knowledge and insights from experienced professionals in the field of software engineering.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2025",
  "EducationText": "Use this to add some narrative to your education section",
  "Employment": "Seattle Pacific University",
  "Role": "Computer Science Lab Assistant",
  "EmploymentText": "Use this to add some narrative to your employment section",
  "Skills": ["C++", " JavaScript", " Node", " CSS"," HTML"],
  "SkillsText": "Use this to add some narrative to your skills section",
  "Resume": "Shukra_resume.pdf"  
},
"Project1": {
    "Title": "Project 1 - Webcrawler",
    "Desc": "This project involves developing a web crawling program that navigates websites from a provided link to gather information and create a visual graph of the site’s structure. The graph consists of nodes representing web pages and edges representing links, all with uniform weight. The program calculates the closeness centrality of each node, indicating the proximity of each page based on the shortest paths to other pages. This visualization offers insights into the interconnectivity and organization of the website, helping to understand its structure and link relationships more deeply..",
    "MainImage": "P1Main.png"
  
  }
}
